
CREATE DATABASE `weixin_may` ;

USE `weixin_may`;

DROP TABLE IF EXISTS `book`;
CREATE TABLE `book` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `isbn` varchar(16) DEFAULT NULL,
  `category` varchar(16) DEFAULT NULL COMMENT '分类',
  `binding` varchar(16) DEFAULT NULL COMMENT '装订方式',
  `title` varchar(64) DEFAULT NULL COMMENT '书名',
  `subtitle` varchar(255) DEFAULT NULL COMMENT '子标题',
  `author` varchar(128) DEFAULT NULL COMMENT '作者',
  `summary` varchar(1024) DEFAULT NULL COMMENT '摘要',
  `image` varchar(1024) DEFAULT NULL COMMENT '图片',
  `price` double DEFAULT NULL COMMENT '价格',
  `pages` int(11) DEFAULT NULL COMMENT '页数',
  `pubdate` date DEFAULT NULL COMMENT '出版日期',
  `publisher` varchar(128) DEFAULT NULL COMMENT '出版社',
  `translator` varchar(128) DEFAULT NULL COMMENT '译者',
  `fav_nums` int(11) DEFAULT '0' COMMENT '点赞数',
  `like_status` int(11) DEFAULT '0' COMMENT '点赞状态',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=38 DEFAULT CHARSET=utf8;


insert  into `book`(`id`,`isbn`,`category`,`binding`,`title`,`subtitle`,`author`,`summary`,`image`,`price`,`pages`,`pubdate`,`publisher`,`translator`,`fav_nums`,`like_status`) values 
(1,'9787544225502','小说','平装','长恨歌',NULL,'王安忆','一个女人四十年的情与爱，被一枝细腻而绚烂的笔写得哀婉动人，其中交织着上海这所大都市从四十年代到九十年代沧海桑田的变迁。生活在上海弄堂里的女人沉垒了无数理想、幻灭、躁动和怨望，她们对情与爱的追求，她们的成败，在我们眼前依次展开。王安忆看似平淡却幽默冷峻的笔调，在对细小琐碎的生活细节的津津乐道中，展现时代变迁中的人和城市，被誉为“现代上海史诗”。','https://img3.doubanio.com/view/subject/l/public/s3018752.jpg',22,350,'2003-08-01','南海出版公司',NULL,123,1),
(2,'9789573305545','小说','平装','撒哈拉的故事',NULL,'三毛','关于漂泊的一切','https://img3.doubanio.com/view/subject/l/public/s3563113.jpg',34,240,'1976-01-01','皇冠出版社',NULL,42,0),
(3,'9787020026906','小说','平装','白鹿原',NULL,'陈忠实','这是一部渭河平原五十年变迁的雄奇史诗，一轴中国农村班斓多彩、触目惊心的长幅画卷。主人公六娶六丧，神秘的序曲预示着不祥。一个家族两代子孙，为争夺白鹿原的统治代代争斗不已，上演了一幕幕惊心动魄的活剧：巧取风水地，恶施美人计，孝子为匪，亲翁杀媳，兄弟相煎，情人反目……大革命、日寇入侵、三年内战，白鹿原翻云覆雨，王旗变幻，家仇国恨交错缠结，冤冤相报代代不已……古老的土地在新生的阵痛中颤栗。厚重深邃的思想内容，复杂多变的人物性格，跌宕曲折的故事情节，绚丽多彩的风土人情，形成作品鲜明的艺术特色和令人震撼的真实感。','https://img1.doubanio.com/view/subject/l/public/s9137567.jpg',28,677,'1997-12-01','人民文学出版社',NULL,534,0),
(4,'9789862131176','漫画','平装','星空',NULL,'幾米 ','《星空》以一种年龄的视角，描绘了一类无法和世界沟通的孩子 ，从对社会的恐慌、逃避到逐步认识自我的过程。《星空》的画面精彩、震撼、美轮美奂，是几米目前最辉煌的绘画作品之一。','https://img3.doubanio.com/view/subject/l/public/s4150073.jpg',24,136,'2009-05-01','大塊文化',NULL,42,0),
(5,'9787020042494','漫画','平装','小王子',NULL,'[法] 安东尼·德·圣-埃克苏佩里 ','小王子是一个超凡脱俗的仙童，他住在一颗只比他大一丁点儿的小行星上。陪伴他的是一朵他非常喜爱的小玫瑰花。但玫瑰花的虚荣心伤害了小王子对她的感情。小王子告别小行星，开始了遨游太空的旅行。他先后访问了六个行星，各种见闻使他陷入忧伤，他感到大人们荒唐可笑、太不正常。只有在其中一个点灯人的星球上，小王子才找到一个可以作为朋友的人。但点灯人的天地又十分狭小，除了点灯人他自己，不能容下第二个人。在地理学家的指点下，孤单的小王子来到人类居住的地球。','https://img3.doubanio.com/view/subject/l/public/s1103152.jpg',22,97,'2003-08-01','人民文学出版社','马振聘 ',354,0),
(6,'9787020049295','小说','平装','平凡的世界',NULL,'路遥','《平凡的世界》是一部现实主义小说，也是一部小说形式的家族史。作者浓缩了中国西北农村的历史变迁过程，在小说中全景式地表现了中国当代城乡的社会生活。在近十年的广阔背景下，通过复杂的矛盾纠葛，刻划社会各阶层众多普通人的形象。劳动与爱情，挫折与追求，痛苦与欢乐，日常生活与巨大社会冲突，纷繁地交织在一起，深刻地展示了普通人在大时代历史进程中所走过的艰难曲折的道路。','https://img3.doubanio.com/view/subject/l/public/s2335693.jpg',64,1631,'2005-01-01','人民文学出版社',NULL,142,0),
(7,'9787805200132','小说','平装','三国演义',NULL,'罗贯中','滚滚长江东逝水，浪花淘尽英雄。吕布赵云关羽，官渡赤壁街亭，斩华雄空城计长坂坡七擒七纵，一看三叹，三国风云起，几度夕阳红。该剧展现了历史上一个豪强们为攫取最高统治权而进行的政治斗争和频繁混战的动乱时代。展示了魏、蜀、吴纵横捭阖、逐鹿争雄的历史画卷！','https://img3.doubanio.com/view/subject/l/public/s1661101.jpg',54,638,'1986-06-01','岳麓书社',NULL,325,0),
(8,'9787111213826','编程','平装','Java编程思想',NULL,'[美] Bruce Eckel ','本书赢得了全球程序员的广泛赞誉，即使是最晦涩的概念，在Bruce Eckel的文字亲和力和小而直接的编程示例面前也会化解于无形。从Java的基础语法到最高级特性（深入的面向对象概念、多线程、自动项目构建、单元测试和调试等），本书都能逐步指导你轻松掌握。','https://img3.doubanio.com/view/subject/l/public/s27243455.jpg',108,880,'2007-06-01','机械工业出版社','陈昊鹏',129,0),
(9,'9781302023683','编程','平装','数据结构（C语言版）',NULL,'严蔚敏 / 吴伟民 ','《数据结构》（C语言版）是为“数据结构”课程编写的教材，也可作为学习数据结构及其算法的C程序设计的参数教材。','https://img3.doubanio.com/view/subject/l/public/s26540471.jpg',29,335,'2012-05-01','清华大学出版社',NULL,175,0),
(10,'9787111370048','编程','平装','Java并发编程实战',NULL,'Brian Goetz / Tim Peierls / Joshua Bloch ...','本书深入浅出地介绍了Java线程和并发，是一本完美的Java并发参考手册。书中从并发性和线程安全性的基本概念出发，介绍了如何使用类库提供的基本并发构建块，用于避免并发危险、构造线程安全的类及验证线程安全的规则，如何将小的线程安全类组合成更大的线程安全类，如何利用线程来提高并发应用程序的吞吐量，如何识别可并行执行的任务，如何提高单线程子系统的响应性，如何确保并发程序执行预期任务，如何提高并发代码的性能和可伸缩性等内容，最后介绍了一些高级主题，如显式锁、原子变量、非阻塞算法以及如何开发自定义的同步工具类。','https://img3.doubanio.com/view/subject/l/public/s7663093.jpg',69,293,'2012-02-01','机械工业出版社华章公司','童云兰 ',167,0),
(11,'9787506320511','小说','平装','檀香刑',NULL,'莫言','《檀香刑》是莫言潜心五年完成的一部长篇新作。在这部神品妙构的小说中，莫言以1900年德国人在山东修建胶济铁路、袁世凯镇压山东义和团运动、八国联军攻陷北京、慈禧仓皇出逃为历史背景，用摇曳多姿的笔触，大悲大喜的激情，高瞻深睿的思想，活灵活现地讲述了发生在“高密东北乡”的一场可歌可泣的农民运动，一桩骇人听闻的酷刑，一段惊心动魄的爱情。','https://img3.doubanio.com/view/subject/l/public/s1073110.jpg',27,518,'2001-03-01','作家出版社',NULL,106,0),
(12,'9787532136766','小说','平装','蛙',NULL,'莫言','与莫言以往小说更注重历史幻想色彩不同的是，《蛙》更接近历史现实的书写，主要讲述的是乡村医生“姑姑”的一生。“姑姑”的父亲是八路军的军医，在胶东一带名气很大。“姑姑”继承衣钵，开始在乡村推行新法接生，很快取代了“老娘婆”们在妇女们心中的地位，用新法接生了一个又一个婴儿。“姑姑”接生的婴儿遍布高密东北乡，可丧生于“姑姑”之手的未及出世的婴儿也遍布高密东北乡。姑姑一面行医，一面带领着自己的徒弟们执行计划生育政策。让已经生育的男人结扎，让已经生育的怀孕妇女流产，成了“姑姑”的两件大事。','https://img3.doubanio.com/view/subject/l/public/s4104535.jpg',27,340,'2009-12-01','上海文艺出版社',NULL,105,0),
(13,'9787500831112','小说','平装','丰乳肥臀',NULL,'莫言','小说中通过母亲，含辛茹苦、艰难的抚育着一个又一个儿女，并且视上官金童为生命一般重要，其用意在于说明：人永远是宇宙中最宝贵的，生命具有无可争辩的意义，是第一本位的，“种”的繁衍生殖（即上官金童的重要与受宠）自然就具有无与伦比的重要意义。生命的承传、沿袭是人类赖以永恒存在的源泉。宇宙中的一切事物，因为有了生命的存在才显示了自身的价值和意义。小说也正是在这种意义上揭示了：人不仅是历史的主体，也是美的主体、生命的承传、延续是当最受到礼赞的。没有生命的宇宙和世界，无论美与丑、纯洁与肮脏、卑鄙与高尚，都不再具有意义。所以我们才悟得了《易传》中“天地之大德曰生”的真正含义。小说或作者的深刻性也就在于将这个似简单又普泛深刻的道理蕴含在母亲率领儿女们的顽强的求生保种的生命过程中。','https://img3.doubanio.com/view/subject/l/public/s1102803.jpg',49.8,450,'2003-09-01','中国工人出版社',NULL,104,0),
(14,'9787506335058','小说','平装','生死疲劳',NULL,'莫言','《生死疲劳》是一部向中国古典小说和民间叙事的伟大传统致敬的大书。在这次神圣的“认祖归宗”仪式中，小说将六道轮回这一东方想象力草灰蛇线般隐没在全书的字里行间，写出了农民对生命无比执著的颂歌和悲歌。','https://img1.doubanio.com/view/subject/l/public/s5743437.jpg',39,540,'2006-01-01','作家出版社',NULL,103,0),
(15,'9787506308595','小说','平装','红高粱','莫言文集.卷1','莫言','暂无','https://img3.doubanio.com/view/subject/l/public/s3539812.jpg',21.4,588,'1995-01-01','作家出版社',NULL,102,0),
(16,'9787544213745','小说','精装','红高粱家族',NULL,'莫言','暂无','https://img3.doubanio.com/view/subject/l/public/s25996415.jpg',18,373,'1999-05-01','南海出版公司',NULL,121,0),
(17,'9787538702682','小说','平装','透明的红萝卜',NULL,'莫言','暂无','https://img3.doubanio.com/view/subject/l/public/s1167505.jpg',19,434,'2000-08-01','时代文艺出版社',NULL,120,0),
(18,'9787531325864','小说','平装','四十一炮',NULL,'莫言','《四十一炮》这部小说中以五神通庙为主要现实场景，在民间五通神是肉欲的象征，虚线折射了老和尚过去荣华靡烂的生活——一个身份非同凡响的国民党军官，过着灯红酒绿、奢靡肉欲的生活，他以一次能占有数十个女人而自豪，可对手一枪，就打碎了他的自傲之物。《四十一炮》如一部出于魔幻现实主义大师导演的电影，我——罗小通的经历和老和尚的经历——实与虚画面交替转换，人们在力图忏悔自我的罪恶时，也逐渐向神圣趋近。','https://img3.doubanio.com/view/subject/l/public/s1068190.jpg',25,445,'2003-07-01','春风文艺出版社',NULL,119,0),
(19,'9787532133215','小说','平装','酒国',NULL,'莫言','《酒国》中的官员之所以为官，不是因为他们才华高过他人，而是因为海量，并且食欲旺盛。吃的影响已经到了这样一种地步，吃可以改变一个人的命运。《酒国》不是通常意义上的反腐小说，莫言在酒国中还通过酒国酿造学院勾兑专业的博士研究生李一斗不断寄给作家莫言的小说中，几乎将整个20世纪中国各种各样小说，从狂人日记到武侠小说，再到魔幻小说、先锋小说之类都戏仿了一遍。','https://img3.doubanio.com/view/subject/l/public/s3227482.jpg',22,344,'2008-08-01','上海文艺出版社',NULL,118,0),
(20,'9787532146314','小说','平装','天堂蒜薹之歌',NULL,'莫言','《天堂蒜薹之歌》是莫言1988年创作的一部体现中国作家良知、反映弱势群体生存状态的力作。小说取材于现实生活中发生的真实事件：数千农民响应县政府的号召大量种植蒜薹，结果蒜薹全部滞销，县政府官员却不闻不问，忧心如焚的农民自发聚集起来，酿成了震惊一时的“蒜薹事件”。这起被报纸报道的事件促使莫言放下正在创作中的家族小说，用了三十五天，创作出这部义愤填膺的长篇力作。在结构上，这部小说采用民间艺人演唱与正文叙述结合的互文方式，汹涌澎湃，充满力度。此次出版的为全新修订版。','https://img1.doubanio.com/view/subject/l/public/s22792338.jpg',33,344,'2012-10-01','上海文艺出版社',NULL,117,0),
(21,'9787532128464','小说','平装','白狗秋千架',NULL,'莫言','《白狗秋千架》是莫言从事文学创作二十余年所发表的短篇小说全集之一，集结了莫言自一九八一年至一九八九年创作发表的三十篇作品，其中《春夜雨霏霏》、《丑兵》、《黑沙滩》等七篇作品是首次结集出版，弥足珍贵。莫言的短篇小说故事饱满，风格多样，好似从肥沃而丰富的中国土地上生长出来的丰姿多彩的朵朵奇葩，既对乡村残酷现实的犀利揭露，也有对乡村纯朴爱情的感人描写，还有种种荒诞离奇却又逼真入神的传奇述说……这些作品的结集，可以让读者充分欣赏到莫言作品的艺术魅力，同时也可以看到文学大家从事小说创作的发展轨迹。','https://img3.doubanio.com/view/subject/l/public/s1599070.jpg',36,430,'2005-06-01','上海文艺出版社',NULL,116,0),
(22,'9787506366779','小说','平装','用耳朵阅读',NULL,'莫言','《莫言文集:用耳朵阅读》内容简介：好的小说，能让读者在阅读时产生仿佛进入了一个村庄、一个集市、一个非常具体的家庭的感受，好的小说能使痴心的读者把自己混同于其中的人物，为之爱，为之恨，为之生，为之死。','https://img3.doubanio.com/view/subject/l/public/s24411514.jpg',31,331,'2012-10-01','作家出版社',NULL,115,0),
(23,'9787800288869','小说','平装','红树林',NULL,'莫言','他说：您的事业蒸蒸日上，财富也是滚滚而来。但是，您的感情生活一直不顺。您这一生中有过一次刻骨铭心的爱情，但是您爱的人最终背叛了您。您一怒之下嫁给了一个您不爱的人。您与这个不爱的人好像还生了几个孩子。','https://img3.doubanio.com/view/subject/l/public/s5670531.jpg',28,333,'2005-08-01','现代出版社',NULL,114,0),
(24,'9787544330138','小说','平装','莫言自选集',NULL,'莫言','面对着这样的时代，一个作家应该保持冷静的心态，透过过剩的媒体制造的信息垃圾，透过浮躁的社会泡沫，去体验观察浸透了人类情感的朴实生活。只有朴实的、平凡人民的平凡生活才是生活的主流，在这样的生活中，默默涌动着真正的情感、真正的创造性和真正的人的精神，而这样的生活，才是文学艺术的真正的资源。','https://img3.doubanio.com/view/subject/l/public/s6061773.jpg',48,723,'2009-06-01','海南出版社',NULL,113,0),
(25,'9787535430144','小说','平装','莫言作品精选','跨世纪文丛精华本','莫言','言，原名管谟业，中国新一辈极具活力的作家之一。自八十年代中以一系列乡土作品崛起。虽然早期被归类为“寻根派”作家，但其写作风格素以大胆见称，小说中总是充满进攻型的语言。例如成名作《红高粱家族》里，不断出现的血腥场面中充满着强烈的感情控诉，但在“屎尿横飞”的场景之间，其实正是演义着一段现代革命的历史。故事中那片广袤狂野的高粱地，也被描绘成一个把历史、传统、城乡纵横交错的辽阔炫丽空间。','https://img1.doubanio.com/view/subject/l/public/s1469617.jpg',25,359,'2005-05-01','长江文艺出版社',NULL,112,0),
(26,'9787540203382','小说','平装','莫言精选集',NULL,'莫言','对越自卫反击站13年后，少校军官赵金回乡探亲，湍急的河流挡住了回家之路，却幸遇分别多年的战友、幼时的玩伴——钱英豪、郭金库……','https://img3.doubanio.com/view/subject/l/public/s8882930.jpg',16,391,'2011-05-24','北京燕山出版社',NULL,111,0),
(27,'9787532129539','小说','平装','莫言·北海道走笔',NULL,'莫言','莫言最初是以电影《红高粱》的原著作者身份而在日本为人所知，此后，他的主要作品被翻译成日语广泛流传，逐渐成为在当地颇具影响力的中国当代作家。2004年年底至2005年年初，应北海道有关方面邀请，历时12天，纵横三千公里，莫言一行人的足迹几乎遍及北海道。而另一个很重要的吸引莫言前往的原因是，他想亲眼看看他的老乡刘连仁——上世纪40年代初被日军强掳去当劳工，后逃亡——在那儿过了足足13年野人生活的地方。在旅途中，莫言与旅伴们畅谈文学、艺术、人生、动物、战争、过年，与当地普通的学生、影迷、乡民交流，谈吐风趣，见解独到，这些都在书中得到了生动的展现。','https://img3.doubanio.com/view/subject/l/public/s5641442.jpg',75,181,'2006-01-01','上海文艺出版社',NULL,110,0),
(28,'9787511001108','小说','平装','变',NULL,'莫言','《变》是一篇描述三十年来中国所发生的巨大变化的文章。二○○五年一月，女儿笑笑陪我去意大利乌迪内取NONINO国际文学奖。其间，结识了印度加尔各答一家出版社的编辑NaveenKishore。女儿与他用英文交谈，我坐在旁边看他。这是一个面部轮廓极为鲜明，沉默寡言的黑皮中年男子，穿一身黑色制服，披一件黑色风衣，担一架看上去十分沉重的黑色照相机。','https://img3.doubanio.com/view/subject/l/public/s6214795.jpg',13.8,85,'2010-08-01','海豚出版社',NULL,109,0),
(29,'9787510434600','小说','平装','我们的荆轲',NULL,'莫言','莫言获得诺奖后的新作，也是他的首部剧作集。包括《我们的荆轲》、《霸王别姬》、《锅炉工的妻子》三部剧本。《我们的荆轲》除了大段内心独白，舞台设计也采取写意写实结合的方法。与以往的荆轲题材的话题不同，该剧作集以一种全新的视角，全新解读那段熟悉的历史。荆轲将不再是舍生取义的侠义精神，而是一举成名的心态。《霸王别姬》同样是历史故事新说，莫言在该剧中将刻画人物的理念运用至极致，向读者展示出一个为爱而生为爱而死的虞姬。《锅炉工的妻子》是一部现实题材的剧本，也是三部剧中唯一还没有和观众见面的，讲述了一个女知青在社会变迁中的多舛命运。','https://img3.doubanio.com/view/subject/l/public/s22998725.jpg',36,209,'2012-11-01','新世界出版社',NULL,108,0),
(30,'9789574694464','小说','平装','白棉花',NULL,'莫言','年仅17岁的农村青年马成功，一直迷恋着大他几岁、年轻貌美、正直勇敢、身手不凡的青年女子方碧玉。他们有幸一起离开棉田，来到向往已久的棉花加工厂，结识了多才多艺、风流多情、自命不凡的青年才俊李志高；复员军人孙禾斗；社会垃圾“铁捶子”：干部子女孙红花等人，由此开始了一段崭新忙碌的生活和一段不同寻常的爱情故事……','https://img3.doubanio.com/view/subject/l/public/s2860630.jpg',15,128,'2004-04-24','民族出版社',NULL,107,0),
(31,'9787010054605','小说','平装','牛',NULL,'莫言','文化大革命时期，调皮捣蛋的少年罗汉辍学在家，与生产队饲养员杜大爷一起放牛。因生命贫困养不起更多的扣，生产队长麻叔请来了公社兽医站的老董同志为双脊、大小鲁西三头小公牛施行阉割手术。术后，罗汉、杜大爷与三头牛朝夕相处，历经煎熬，大小鲁西终于康复了。但桀骜不训的双脊却因术中大出血，术后感染，在经历了数天的折磨后而不幸死去。','https://img3.doubanio.com/view/subject/l/public/s2860615.jpg',15,111,'2004-04-01','民族出版社',NULL,106,0),
(32,'9787531322047','小说','平装','十三步',NULL,'莫言','本书精选了著名作家莫名的长篇小说数部，这些作品构思精巧，语言流畅，从不同的角度对当代人的生活，爱情、家庭等作了描述，表达了作者所具有的独到的创作风格，非常值得一读。','https://img3.doubanio.com/view/subject/l/public/s1157666.jpg',23,338,'2003-10-01','春风文艺出版社',NULL,105,0),
(33,'9787506333757','小说','平装','会唱歌的墙',NULL,'莫言','本书为\"当代散文大家精品文库\"之一。','https://img1.doubanio.com/view/subject/l/public/s5743048.jpg',20,313,'2005-11-24','作家出版社',NULL,104,0),
(34,'9787532139484','小说','平装','师傅越来越幽默',NULL,'莫言','《师傅越来越幽默》所选是九十年代末至新千年以来的作品。最早的一篇是《牛》，发表于1998年《东海》第三期。最晚的一篇是《变》，发表于2009年第十期《人民文学》。','https://img3.doubanio.com/view/subject/l/public/s8929351.jpg',33,405,'2010-08-01','上海文艺出版社',NULL,103,0),
(35,'9787532128488','小说','平装','食草家族',NULL,'莫言','《食草家族》是莫言肆意挥洒他的奇崛想象力的长篇小说，堪称汉语文学中将荒诞魔幻发展到极致的作品；同时也是一部充分体现莫言的世界哲学的作品。小说以高密东北乡为背景，描写了生活在贫瘠而又富饶的上地上的祖先们与大自然的关系。历史与现实，人为与自然，视觉、味觉、触觉与魔幻荒诞的想象，浓墨重彩与天马行空的抒写，在这部作品中浑然一体，令人惊叹。','https://img3.doubanio.com/view/subject/l/public/s5742436.jpg',28,349,'2005-06-01','上海文艺出版社',NULL,102,0),
(36,'9787500698197','小说','平装','学习蒲松龄',NULL,'莫言','蒲松龄的家乡淄博和莫言的家乡高密离得非常近。莫言小时候就是听蒲氏故事长大的。蒲松龄的奇幻风格给莫言的小说写作带来了非常大的影响，也成就了魔幻主义风格的莫言。本书选自莫言二十余篇鬼故事、鬼传奇，和一些奇奇怪怪、神神鬼鬼的鬼小说，内配高密独有的扑灰年画，带给人好看、神奇、震撼的强视觉冲击力。','https://img3.doubanio.com/view/subject/l/public/s5955495.jpg',33,302,'2011-04-01','中国青年出版社',NULL,120,0),
(37,'9787500695202','小说','平装','我的高密',NULL,'莫言','莫言的小说都是以“高密东北乡”为背景。山东省高密市是他的故乡，是他生活了20年、度过全部青少年时期的热土。莫言说：“过去我感到没有什么东西可写，但自从打上‘高密东北乡’的旗号后我感到要写的东西源源不断地奔涌而来。经常出现这样的情况，当我在写一篇小说的时候，许多新的构思就像狗一样在我身后大叫。”--是什么打开了他记忆的闸门？这个古老而质朴的乡村有什么特别之外？为什么这里能诞生莫言这样的作家？本书带你进入作家莫言神秘而敏感的内心世界，探索他真实的写作秘密。','https://img1.doubanio.com/view/subject/l/public/s4600587.jpg',33,276,'2011-01-01','中国青年出版社',NULL,119,0);


DROP TABLE IF EXISTS `classic`;

CREATE TABLE `classic` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(64) DEFAULT NULL COMMENT '标题',
  `index` int(11) DEFAULT NULL COMMENT '期刊号',
  `image` varchar(255) DEFAULT NULL COMMENT '图片',
  `content` varchar(1024) DEFAULT NULL COMMENT '内容',
  `type` int(11) DEFAULT NULL COMMENT '类型：100 电影 200 音乐 300 句子',
  `pubdata` date DEFAULT NULL COMMENT '发布日期',
  `fav_nums` int(11) DEFAULT NULL COMMENT '点赞数',
  `like_status` int(11) DEFAULT NULL COMMENT '是否点赞',
  `url` varchar(255) DEFAULT NULL COMMENT '音乐播放链接',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

insert  into `classic`(`id`,`title`,`index`,`image`,`content`,`type`,`pubdata`,`fav_nums`,`like_status`,`url`) values 
(1,'李安《饮食男女》',3,'https://may-server.oss-cn-hangzhou.aliyuncs.com/may-server/move.8.png','人生不能像做菜，把所有的料准备好才下锅',100,'2018-12-13',120,1,NULL),
(2,'罗启锐《岁月神偷》',2,'https://may-server.oss-cn-hangzhou.aliyuncs.com/may-server/move.7.png','当你发现时间是贼了，他早已偷光你的选择',100,'2018-12-12',341,0,NULL),
(3,'周星驰《大话西游之大圣娶亲》',1,'https://may-server.oss-cn-hangzhou.aliyuncs.com/may-server/movie.1.png','如果上天能够给我一个再来一次的机会，我会对那个女孩子说三个字：我爱你',100,'2018-12-11',1236,0,NULL),
(4,'锦衣卫之雪域高原',5,'https://may-server.oss-cn-hangzhou.aliyuncs.com/may-server/essay.1.png','辽东九万里  饮马二人行',300,'2018-12-14',24,0,NULL),
(5,'卢冠廷《一生所爱》',4,'https://may-server.oss-cn-hangzhou.aliyuncs.com/may-server/music.1.png','苦海翻起爱恨  在世间难逃避命运',200,'2018-12-15',1436,1,'https://m10.music.126.net/20181229115801/76fac213baed622239ef076a9b1477df/ymusic/978c/ed97/f75d/b7f1af5f3ee02e0871a08ce4a78d57c6.mp3'),
(6,'张学友《她来听我的演唱会》',6,'https://may-server.oss-cn-hangzhou.aliyuncs.com/may-server/music.2.png','她记得月台汽笛声声在催  播我的歌陪着人们流泪',200,'2018-12-16',679,0,'https://m10.music.126.net/20181229120037/6b1f154862d6096fd0910924b2927db8/ymusic/344b/c23a/71f9/5c29810e09d2978a0c61dac103b60f7d.mp3');


DROP TABLE IF EXISTS `hot_word`;

CREATE TABLE `hot_word` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `word` varchar(64) DEFAULT NULL,
  `search_count` int(11) DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;


insert  into `hot_word`(`id`,`word`,`search_count`) values 
(1,'Java',70),
(2,'长恨歌',46),
(3,'编程',45),
(4,'平凡的世界',41),
(5,'编程思想',36),
(6,'白鹿原',31),
(7,'小王子',29),
(8,'三国演义',26),
(9,'数据结构',24),
(10,'并发编程',20),
(11,'异步编程',16),
(12,'阿里巴巴',46),
(13,'莫言',70);


DROP TABLE IF EXISTS `short_comment`;

CREATE TABLE `short_comment` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `book_id` int(11) DEFAULT NULL COMMENT '书籍id',
  `content` varchar(1024) DEFAULT NULL COMMENT '短评内容',
  `nums` int(11) DEFAULT NULL COMMENT '数量',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;


insert  into `short_comment`(`id`,`book_id`,`content`,`nums`) values 
(1,1,'你有没有看见过卸去一面墙的房屋',34),
(2,1,'人事皆非了',23),
(3,1,'哀婉动人',46),
(4,1,'现代上海史诗',129),
(5,1,'沧海桑田',57),
(6,1,'男性要读的一些书',35),
(7,1,'女性',87);


DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `openid` varchar(64) DEFAULT NULL,
  `session_key` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;


DROP TABLE IF EXISTS `user_book`;

CREATE TABLE `user_book` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_openid` varchar(64) DEFAULT NULL,
  `book_id` int(11) DEFAULT NULL,
  `like_status` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



DROP TABLE IF EXISTS `user_classic`;

CREATE TABLE `user_classic` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_openid` varchar(64) DEFAULT NULL,
  `classic_id` int(11) DEFAULT NULL,
  `like_status` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;



